Revit 2027 API
ComboBox.AddItem Method
Adds a new item to the ComboBox.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ComboBoxMember AddItem(
	ComboBoxMemberData memberData
)
Public Function AddItem (
	memberData As ComboBoxMemberData
) As ComboBoxMember
public:
ComboBoxMember^ AddItem(
	ComboBoxMemberData^ memberData
)
member AddItem :
        memberData : ComboBoxMemberData -> ComboBoxMember
Parameters
memberData ComboBoxMemberData
An object containing the data needed to construct the ComboBoxMember.
Return Value
ComboBoxMember
 The newly added ComboBoxMember.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when memberData is null.
ArgumentException |  Thrown when button with memberData.Name already exists in the drop-down list.
See Also
Reference
ComboBox Class
Autodesk.Revit.UI Namespace